INSERT INTO list_performer(name, alias)
VALUES
('Майкл Джексон', '-'),
('Шнуров', '-'),
('Канье Уэст', '-'),
('Честер Бэннингтон', '-'),
('Луи Армстронг', '-'),
('Валерий Кипелов', '-'),
('Вилли Нельсон', '-'),
('Мария Каллас', '-');


INSERT INTO list_genre(title)
VALUES
('Поп'),
('Рок'),
('Опера'),
('Джаз'),
('Кантри');


INSERT INTO albums(name_album, year_release)
VALUES
('Альбом 1', 2018),
('Альбом 2', 1991),
('Альбом 3', 2019),
('Альбом 4', 2020),
('Альбом 5', 2018),
('Альбом 6', 2017),
('Альбом 7', 2003),
('Альбом 8', 1982);


INSERT INTO list_tracks(name, duration, id_album)
VALUES
('Трек 1', 67, 1),
('Трек 2', 67, 1),
('Трек 3', 167, 3),
('Трек 4', 107, 4),
('Трек 5', 180, 5),
('Трек мой', 204, 6),
('Трек 7', 47, 7),
('Трек 8', 258, 8),
('Трек 9 мой', 297, 1),
('Трек 10', 348, 1),
('Трек 11', 251, 3),
('Трек 12', 561, 4),
('Трек 13', 494, 5),
('Трек 14', 111, 6),
('Трек 15', 752, 7);


INSERT INTO list_collections(name, year_release)
VALUES
('Сборник 1', 2000),
('Сборник 2', 2008),
('Сборник 3', 1999),
('Сборник 4', 2020),
('Сборник 5', 2019),
('Сборник 6', 2018),
('Сборник 7', 2003),
('Сборник 8', 1995);


INSERT INTO list_performer_albums(id_performer, id_album)
VALUES
(2, 1),
(2, 3),
(3, 2),
(4, 5),
(5, 4),
(6, 2),
(6, 1),
(3, 3),
(7, 7),
(7, 1),
(8, 8),
(1, 4),
(1, 7);


INSERT INTO list_genre_performer(id_performer, id_genre)
VALUES
(2, 2),
(2, 1),
(3, 5),
(4, 4),
(5, 3),
(6, 1),
(7, 1),
(8, 5);


INSERT INTO list_collections_tracks(id_collection, id_track)
VALUES
(1, 15),
(2, 14),
(3, 13),
(4, 12),
(5, 11),
(6, 10),
(7, 9),
(8, 8),
(1, 4),
(2, 6),
(3, 5),
(4, 4),
(5, 3),
(6, 2),
(7, 4),
(8, 15),
(1, 14),
(2, 13),
(3, 12),
(4, 11);